buzzwang1/pcb/source/main/STM32U575ZI/Examples/DMA/M2SpiHal/main.h
#ifndef __MAIN_H__
#define __MAIN_H__

#include "LED.h"

//System
#include "CycleCaller.h"

#ifdef __cplusplus
 extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/
#include "TypeDef.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_ll_pwr.h"
#include "stm32u5xx_ll_bus.h"
#include "stm32u5xx_ll_rcc.h"
#include "stm32u5xx_ll_system.h"
#include "stm32u5xx_ll_exti.h"
#include "stm32u5xx_ll_utils.h"
#include "stm32u5xx_ll_gpio.h"
#include "stm32u5xx_ll_spi.h"
#include "stm32u5xx_ll_dma.h"

#define BUFFERSIZE                       (COUNTOF(aTxBuffer) - 1)
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))

extern void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef* hspi);
extern void MainSystemInit();

extern void NMI_Handler(void);
extern void HardFault_Handler(void);
extern void MemManage_Handler(void);
extern void BusFault_Handler(void);
extern void UsageFault_Handler(void);
extern void SVC_Handler(void);
extern void DebugMon_Handler(void);
extern void PendSV_Handler(void);
extern void SysTick_Handler(void);

extern void DMA_IRQHandler(void);
extern void EXTI5_IRQHandler(void);
extern void GPDMA1_Channel6_IRQHandler(void);
extern void GPDMA1_Channel7_IRQHandler(void);
extern void SPI1_IRQHandler(void);



#ifdef __cplusplus
}
#endif

#endif  //MAIN
